Assignment 3/Assignment 3 - Chunhao Liu/app/views/carts/show.html.erb


<% if @cart.lineitems.length > 0 %>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 1]]


    <% @cart.lineitems.each do |lineitem| %>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 1]]