Assignment 3/Assignment 3 - Chunhao Liu/app/controllers/application_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-11-21 05:41:40.099218"], ["updated_at", "2020-11-21 05:41:40.099218"]]
---
    def set_cart
        @cart = Cart.find(session[:cart_id])
    rescue
        @cart = Cart.create()