Assignment 3/Assignment 3 - Chunhao Liu/app/controllers/lineitems_controller.rb

    def index
        @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

    def create
        product = Product.find(params[:product_id])
        @lineitem = @cart.add_item(product.id)

        respond_to do |format|
            if @lineitem.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 5], ["cart_id", 1], ["created_at", "2020-11-21 01:38:32.900800"], ["updated_at", "2020-11-21 01:38:32.900800"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2020-11-21 01:46:26.920934"], ["id", 2]]