Assignment 3/Assignment 3 - Chunhao Liu/app/controllers/orders_controller.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 2]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
---
    def new
        if @cart.lineitems.empty?

INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "123"], ["address", "123"], ["email", "3213"], ["paytype", "Check"], ["created_at", "2020-11-21 04:30:25.259369"], ["updated_at", "2020-11-21 04:30:25.259369"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 13]]
---
    def create
        @order = Order.new(order_params)
        @order.add_items_from_cart(@cart)

        respond_to do |format|
            if @order.save
                Cart.destroy(session[:cart_id])