Assignment 3/Assignment 3 - Chunhao Liu/app/controllers/shopper_controller.rb

  def index
      @products = Product.order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

  def search
      @products = Product.where("name like ?", "%#{params[:name]}%")
---
SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Air"], ["LIMIT", 1]]

  def show
      @product = Product.find_by(name: params[:name])
---
SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Apple M1 Chip Mac mini"], ["LIMIT", 1]]