Assignment 3/Assignment 3 - Chunhao Liu/app/models/order.rb

    def add_items_from_cart(cart)
        cart.lineitems.each do |item|
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 3]]